#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.resume.data.aws_ecr_image.lambda_image: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_response_processor.data.aws_caller_identity.current: Reading...
module.resume.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_availability_zones.available: Reading...
data.aws_cognito_user_pools.api_cognito: Reading...
module.email_response_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-response-processor-dev]
module.list_collections.module.integration_base.data.aws_caller_identity.current: Reading...
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo]
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.attachment_saver.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.attachment_saver.data.aws_ecr_image.lambda_image: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.list_collections.module.integration_base.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.attachment_saver.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_cognito_user_pools.api_cognito: Read complete after 0s [id=estaec814cb7e6_userpool_814cb7e6-dev]
module.attachment_saver.module.lambda_function_container_image.data.aws_region.current: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_ami.latest_amazon_linux: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.attachment_saver.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.resume.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:846b2f8f46eb849debb3a38c510a2c4587ceee5d3480401d92c648157d6f9d3c]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.attachment_saver.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:cc7d369c910e0754b221ecdb4db0fe766a557d1a0a0c676157a125b2a0381061]
module.email_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-request-processor-dev]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.resume_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:2e66309c45e0bdf2bca629c3c60a2b5e9ecf3eeff361ce08cbec344b7ccedd43]
module.email_request_preprocessor.data.aws_caller_identity.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.transcription_processor.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.email_request_preprocessor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.resume_request_processor.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:be239a58d1a824e0d12f6e73f7437f3eef290cc4f18d99a1a6667c3d72643e82]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume_request_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.resume_request_preprocessor.data.aws_ecr_image.lambda_image: Reading...
module.email_request_preprocessor.data.aws_ecr_image.lambda_image: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.transcription_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.integration_base.data.aws_caller_identity.current: Reading...
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.inference.module.integration_base.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.resume.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.resume.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_response_processor.data.aws_ecr_image.lambda_image: Reading...
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:a98262a03848b81a39e3890309f7e4c2f426c1db617bfc4514fdc79bd8948aba]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_request_preprocessor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-request-preprocessor-dev]
module.transcription_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:f8467e50a928e11ff5649e3a230ea58e1c44328f533867516e172b3ffa534f79]
module.resume_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.resume_request_preprocessor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:16c89e61942bfa2b19e1250493562e3352fd5c4c46f07abbe602832aae35fa01]
module.transcription_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3806204806]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_processor.data.aws_ecr_image.lambda_image: Reading...
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:de99051bf5a8455b1940d2d92868ef7d1492f6a461b10cf348032f777918136e]
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.resume_request_preprocessor.data.aws_caller_identity.current: Reading...
module.email_request_preprocessor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:0a517a1e95c443b09ffe1281aab695df0959bf1c65a172c32776cf8fea2b2e52]
module.resume_request_processor.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume_request_preprocessor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.resume_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-0bef12ee7bc073414]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 1s [id=446872271111]
module.resume.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 1s [id=446872271111]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.resume.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
aws_ses_receipt_rule_set.main_rule_set: Refreshing state... [id=levio-demo-fev-esta-rule-set-dev]
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.integration_cognito.data.aws_caller_identity.current: Reading...
module.inference.module.integration_cognito.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:2d0c4518f5cdd11e170735882b6539c3734477dbb1530630f38512e9856213dc]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=734877482]
module.attachment_saver.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.resume_request_processor.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:5c8ea29ab123c034a72354bfa7e315dd27beccfdfd3b6241b928035a0dc98692]
module.attachment_saver.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.transcription_processor.data.aws_caller_identity.current: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.transcription_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_iam_role.this: Refreshing state... [id=levio-demo-fev-api-role]
module.email_request_processor.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:55322280f1cd12863ce13daec7262342a51b0e32d9b5035776723799f339b6b9]
module.resume.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_request_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-request-processor-queue-dev.fifo]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev-role]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:a7cf029d6f4f39bb48eb5570e94acf71842d22f56242b6eb6221d7b3500d997e]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
aws_api_gateway_authorizer.this: Refreshing state... [id=p9hrwu]
aws_ses_active_receipt_rule_set.active_main_rule_set: Refreshing state... [id=levio-demo-fev-esta-rule-set-dev]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
aws_iam_role_policy.this: Refreshing state... [id=levio-demo-fev-api-role:this]
aws_api_gateway_account.this: Refreshing state... [id=api-gateway-account]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3325663242]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2314128230]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=4z02sq]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1473281441]
module.inference.module.integration_cognito.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=uvd5hn]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.inference.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=nw7wpk]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1250291985]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
data.aws_iam_policy_document.allow_access_from_ses: Reading...
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-logs]
data.aws_iam_policy_document.allow_access_from_ses: Read complete after 0s [id=1118948238]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-logs]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
data.aws_secretsmanager_secret_version.password: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-preprocessor-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.inference.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-GET]
module.list_collections.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-GET]
module.inference.module.integration_cognito.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-uvd5hn-GET]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2734712511]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194307124300000002]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194307033600000001]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev-role-20240229152012792300000001]
module.s3_bucket.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_bucket.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=1118948238]
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=138245272]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=541121536]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194332717000000003]
module.inference.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-OPTIONS]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-OPTIONS]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-uvd5hn-OPTIONS]
module.list_collections.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev-collections-GET]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-inline]
module.inference.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev-inference-GET]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
module.s3_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
module.inference.module.integration_cognito.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev-inferencecog-GET]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-preprocessor-dev-role-inline]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-uvd5hn-OPTIONS]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-OPTIONS]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-4z02sq-OPTIONS-200]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-uvd5hn-OPTIONS-200]
module.inference.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-nw7wpk-OPTIONS-200]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-OPTIONS]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194332764500000004]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev-role-20240229152014073200000002]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-4z02sq-OPTIONS-200]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-uvd5hn-OPTIONS-200]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-nw7wpk-OPTIONS-200]
module.email_request_preprocessor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=6372d997-1ffe-4d2e-b58c-8870ba706c3d]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.email_request_preprocessor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["ses"]: Refreshing state... [id=ses]
aws_ses_receipt_rule.chat_rule: Refreshing state... [id=levio-demo-fev-esta-chat-rule-dev]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.inference.module.integration_cognito.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-uvd5hn-GET]
module.inference.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-GET]
module.list_collections.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-GET]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
aws_api_gateway_deployment.this: Refreshing state... [id=l65lii]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=mwfvag0h0f]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=f9630eab-ef3d-41c7-bd22-d541cb86d9a8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ last_modified                  = "2024-03-06T15:44:25.000+0000" -> "2024-03-15T15:07:12.000+0000"
      ~ source_code_hash               = "0bd19ee10fcb947949a1e83bb0b1be1b1936b43c40cd430f0a6b3a81ffaa13a1" -> "a09fd78736ef2e69d849fdcb59e4e17125b0e99f3110cc4e6aad7a2e58aa30de"
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ last_modified                  = "2024-03-06T15:43:55.000+0000" -> "2024-03-15T15:06:42.000+0000"
      ~ source_code_hash               = "79af593bcc3b97daca99744c852bc8c24b9380642101a4d26860338705b79dc6" -> "8fbe86d54275e95931aabdb317c8735e1a54d05a1e326123cb7183c6e973680f"
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-03-06T15:44:24Z" -> (known after apply)
      ~ description   = "Deployment for 2024-03-06T15:44:24Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "l65lii" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-03-06T15:44:24Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "xxgojl" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_instance.jumpbox will be created
  + resource "aws_instance" "jumpbox" {
      + ami                                  = "ami-0bef12ee7bc073414"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bastion-rds-dev"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-09be498e3f465bbb5"
      + tags                                 = {
          + "Name" = "jumpbox-instance-dev"
        }
      + tags_all                             = {
          + "Environment" = "dev-dev"
          + "Name"        = "jumpbox-instance-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0b9900b5db426c576",
        ]
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = "levio-demo-fev-esta-ses-bucket-dev"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "resume/attachment/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "resume/email/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "resume/transcription/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-attachment-saver-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-attachment-saver-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "loggroup"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-attachment-saver-dev/*:*"
                      + Sid      = "logwrite"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:List*",
                          + "s3:Get*",
                          + "s3:Describe*",
                          + "s3-object-lambda:WriteGetObjectResponse",
                          + "s3-object-lambda:List*",
                          + "s3-object-lambda:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev/*",
                          + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev",
                        ]
                      + Sid      = "s3"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-attachment-saver-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-attachment-saver-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-attachment-saver-dev-role"
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-attachment-saver-dev-role"
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-attachment-saver-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/attachment_saver@sha256:cc7d369c910e0754b221ecdb4db0fe766a557d1a0a0c676157a125b2a0381061"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["s3"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-attachment-saver-dev"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

  # module.email_request_preprocessor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-preprocessor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_preprocessor@sha256:00b3c067c09817de839f661ef4fda1f99d9df1081f339af30325de6d2281c945" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_preprocessor@sha256:0a517a1e95c443b09ffe1281aab695df0959bf1c65a172c32776cf8fea2b2e52"
      ~ last_modified                  = "2024-03-15T15:06:42.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:a09fd78736ef2e69d849fdcb59e4e17125b0e99f3110cc4e6aad7a2e58aa30de" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:55322280f1cd12863ce13daec7262342a51b0e32d9b5035776723799f339b6b9"
      ~ last_modified                  = "2024-03-15T15:07:12.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_KEY"   = (sensitive value)
              - "API_URL"   = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/dev/inference"
              - "QUEUE_URL" = "https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-inline"
        name      = "levio-demo-fev-email-response-processor-dev-role-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-email-response-processor-dev/*:*"
                        Sid      = "logwrite"
                    },
                  ~ {
                      ~ Action   = [
                          - "ses:SendEmail",
                          - "ses:SendRawEmail",
                          + "s3:List*",
                          + "s3:Get*",
                          + "s3:Describe*",
                          + "s3-object-lambda:List*",
                          + "s3-object-lambda:Get*",
                        ]
                      ~ Resource = "arn:aws:ses:us-east-1:446872271111:*" -> "arn:aws:s3:*:*:*"
                      ~ Sid      = "ses" -> "s3"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ses:us-east-1:446872271111:*"
                      + Sid      = "ses"
                    },
                    {
                        Action   = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:us-east-1:446872271111:levio-demo-fev-email-response-processor-queue-dev.fifo"
                        Sid      = "sqs"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-response-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:6dbac00a22414b437d936e687171f796c7a7abf14fc9a39b8f506de881744054" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:2d0c4518f5cdd11e170735882b6539c3734477dbb1530630f38512e9856213dc"
      ~ last_modified                  = "2024-03-13T14:29:12.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:8fbe86d54275e95931aabdb317c8735e1a54d05a1e326123cb7183c6e973680f" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:de99051bf5a8455b1940d2d92868ef7d1492f6a461b10cf348032f777918136e"
      ~ last_modified                  = "2024-03-15T15:06:42.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:7f052e8215488e5b696668b5560a19a5592f29d1f4d9b705676255ae3be8041d" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:a98262a03848b81a39e3890309f7e4c2f426c1db617bfc4514fdc79bd8948aba"
      ~ last_modified                  = "2024-03-15T15:06:42.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:f58fd71b8aa7e82270673973c462aeabfb07ab33ca5c79cffb31a4f57b6c6ac0" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:be239a58d1a824e0d12f6e73f7437f3eef290cc4f18d99a1a6667c3d72643e82"
      ~ last_modified                  = "2024-03-15T15:06:42.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:8aed9d990711c4d13c77465f055178cac076158b07d667a08a30f6da0a5bfbb5" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:2e66309c45e0bdf2bca629c3c60a2b5e9ecf3eeff361ce08cbec344b7ccedd43"
      ~ last_modified                  = "2024-03-15T15:06:42.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:f67536304c83e3993beffbf307173ee5f459f567c873f67cc3277a84291fe9cd" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:a7cf029d6f4f39bb48eb5570e94acf71842d22f56242b6eb6221d7b3500d997e"
      ~ last_modified                  = "2024-03-15T15:06:42.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.resume.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-resume-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "bedrock:InvokeModel"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:bedrock:*:*:*"
                      + Sid      = "bedrock"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "loggroup"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-resume-dev/*:*"
                      + Sid      = "logwrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-resume-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.resume.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-dev-role"
    }

  # module.resume.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-dev-role"
    }

  # module.resume.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-resume-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/resume@sha256:846b2f8f46eb849debb3a38c510a2c4587ceee5d3480401d92c648157d6f9d3c"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PROMPT" = "Refais ce texte sous forme de dialogues entre un intervenant et ses clients: "
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "loggroup"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-resume-request-preprocessor-dev/*:*",
            ]
          + sid       = "logwrite"
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "requestsqs"
        }
      + statement {
          + actions   = [
              + "s3-object-lambda:Get*",
              + "s3-object-lambda:List*",
              + "s3-object-lambda:WriteGetObjectResponse",
              + "s3:Describe*",
              + "s3:Get*",
              + "s3:List*",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev",
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev/*",
            ]
          + sid       = "s3"
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-resume-request-preprocessor-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-request-preprocessor-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-request-preprocessor-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-resume-request-preprocessor-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-request-preprocessor-dev-role"
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-request-preprocessor-dev-role"
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-resume-request-preprocessor-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/resume_request_preprocessor@sha256:16c89e61942bfa2b19e1250493562e3352fd5c4c46f07abbe602832aae35fa01"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["s3"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-resume-request-preprocessor-dev"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

  # module.resume_request_processor.module.fifo_sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "levio-demo-fev-resume-request-processor-queue-dev.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "lambda"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "loggroup"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-resume-request-processor-dev/*:*",
            ]
          + sid       = "logwrite"
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "requestsqs"
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:446872271111:levio-demo-fev-email-response-processor-queue-dev.fifo",
            ]
          + sid       = "responsesqs"
        }
      + statement {
          + actions   = [
              + "s3-object-lambda:Get*",
              + "s3-object-lambda:List*",
              + "s3-object-lambda:WriteGetObjectResponse",
              + "s3:Describe*",
              + "s3:Get*",
              + "s3:List*",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev",
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev/*",
            ]
          + sid       = "s3"
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-resume-request-processor-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-request-processor-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-request-processor-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-resume-request-processor-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-request-processor-dev-role"
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-request-processor-dev-role"
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"] will be created
  + resource "aws_lambda_event_source_mapping" "this" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-resume-request-processor-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/resume_request_processor@sha256:5c8ea29ab123c034a72354bfa7e315dd27beccfdfd3b6241b928035a0dc98692"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME"     = "levio-demo-fev-esta-ses-bucket-dev"
              + "DIALOGUE_PROMPT" = "Refais ce texte sous forme de dialogues entre un intervenant et ses clients: "
              + "FUNCTION_NAME"   = "levio-demo-fev-resume-dev"
              + "QUEUE_URL"       = "https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo"
              + "RESUME_PROMPT"   = "Tu es un travailleur social. Fais une analyse de ce texte. Ne résume pas trop, permets toi d'avoir du contenu pour soutenir ta réponse"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-resume-request-processor-dev"
      + id                  = (known after apply)
      + principal           = "sqs.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "sqs"
      + statement_id_prefix = (known after apply)
    }

  # module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "iam"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "loggroup"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-transcription-processor-dev/*:*",
            ]
          + sid       = "logwrite"
        }
      + statement {
          + actions   = [
              + "s3-object-lambda:Get*",
              + "s3-object-lambda:List*",
              + "s3-object-lambda:WriteGetObjectResponse",
              + "s3:Describe*",
              + "s3:Get*",
              + "s3:List*",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev",
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev/*",
            ]
          + sid       = "s3"
        }
      + statement {
          + actions   = [
              + "transcribe:GetTranscriptionJob",
              + "transcribe:StartTranscriptionJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:transcribe:us-east-1:446872271111:transcription-job/*",
            ]
          + sid       = "transcribe"
        }
    }

  # module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-transcription-processor-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-transcription-processor-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-transcription-processor-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "transcribe.amazonaws.com",
                              + "lambda.amazonaws.com",
                              + "lambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-transcription-processor-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-transcription-processor-dev-role"
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-transcription-processor-dev-role"
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-transcription-processor-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/transcription_processor@sha256:f8467e50a928e11ff5649e3a230ea58e1c44328f533867516e172b3ffa534f79"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["s3"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-transcription-processor-dev"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

Plan: 44 to add, 10 to change, 1 to destroy.

Changes to Outputs:
  ~ instance_ip      = "3.90.173.220" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @brunoabreu-levio, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*